{
    "character1":{
        "name": "Snow White",
        "role": "Protagonist",
        "description": "A 14 year old girl and the stepdaughter of the Evil Queen. She seems to have a sweet and caring personality, but she has a sassy side that is often overlooked.",
        "trivia": "Snow White is the third animated character to have a star on the Hollywood Walk of Fame, and is the only Disney Princess to have one."
    },"character2":{
        "name": "Evil Queen",
        "role": "Antagonist",
        "description": "Considered one of the most iconic Disney villains. She is ruthless, jealous, and extremely vain. Upon her transformation into an old witch, she becomes more maniacal.",
        "trivia": "Early promotional material gave her the name Queen Grimhilde."
    },"character3":{
        "name": "Pinocchio",
        "role": "Protagonist",
        "description": "A wooden puppet created by the woodcarver Geppetto and imbued with life by the Blue Fairy. He behaves as most young children do, but learns to be more mature by the end of the movie.",
        "trivia": "Pinocchio dying and coming back is the first instance of the 'Disney Death' trope, in which a character who is presumed dead either comes back or is revealed to never have been dead."
    },"character4":{
        "name": "Stromboli",
        "role": "Antagonist",
        "description": "A bald puppeteer who only seems to love money, no matter the cost. He presents himself as jolly and good natured, but has a dangerously quick fuse.",
        "trivia": "Stromboli could be considered the evil counterpart of Geppetto."
    },"character5":{
        "name": "Honest John",
        "role": "Antagonist",
        "description": "Also known as J. Worthington Foulfellow, Honest John is an anthropomorphic fox who regularly swindles people out of money. He is persuasive and sly; the hallmark characteristics of foxes.",
        "trivia": "Honest John and his accomplice, Gideon, are the only villains in the film to appear, disappear, and return in later scenes."
    },"character6":{
        "name": "Dumbo",
        "role": "Protagonist",
        "description": "Officially named Jumbo Junior, Dumbo is a baby elephant with very large ears. He has the personality of a small child, being playful and innocent.",
        "trivia": "Dumbo is the only titular character in any Disney film to have no speaking lines."
    }, "character7":{
        "name": "Ringmaster",
        "role": "Antagonist",
        "description": "The head of the circus Dumbo belongs to. He appears to be callous and miserly, treating his animals poorly and underpaying his workers. While he is the movie's antagonist, he isn't outwardly malicious.",
        "trivia": "The Ringmaster's voice actor worked as a circus clown at one point in his life."
    },"character8":{
        "name": "Bambi",
        "role": "Protagonist",
        "description": "A young deer who grows up over the course of the movie. He appears to be curious, shy, and naive, even when he is seen as an adult. It is revealed that he is the son of the most respected deer in the forest.",
        "trivia": "Bambi's movie has no named antagonist, though humans are shown as the main culprit of several events in the movie."
    },"character9":{
        "name": "Thumpber",
        "role": "Protagonist",
        "description": "Bambi's close rabbit friend. He is loud and mischevious, but tries to advise his friends when he can.",
        "trivia": "Thumper was originally meant to have a smaller role, but was given a larger one when some of the writers heard his voice actor."
    },"character10":{
        "name": "Flower",
        "role": "Protagonist",
        "description": "A coy and soft-spoken skunk and another good friend of Bambi. He is friendly and is shown as having a consistently positive outlook on life.",
        "trivia": "Whether Flower's name is his real, given name or not is unknown."
    },"character11":{
        "name": "Cinderella",
        "role": "Protagonist",
        "description": "A kind-hearted and loving young woman, despite her toxic and abusive step-family. Though she is soft-spoken and gentle, she also has a strong will and a sharp wit.",
        "trivia": "The scene in which Cinderella's torn dress transforms into a gown is allegedly Walt Disney's all-time favorite piece of animation."
    },"character12":{
        "name": "Drizella",
        "role": "Antagonist",
        "description": "A vain and selfish young woman and one of Cinderella's step-sisters. Not much seems to be known about her interests, aside from the possibility of being as greedy as her mother.",
        "trivia": "Drizella's hair color hasn't been consistent over future appearances."
    },"character13":{
        "name": "Anastasia",
        "role": "Antagonist",
        "description": "A jealous and spoiled young woman, and one of Cinderella's step-sisters. In her first appearance, she seems to have identical personality traits to her sister, but in further appearances, she seems to change her ways.",
        "trivia": "In a future appearance (Cinderella III), she is shown to be very allergic to roses."
    },"character14":{
        "name": "Evil Stepmother",
        "role": "Antagonist",
        "description": "Officially named Lady Tremaine, the wicked stepmother is cold and cruel. While she is markedly cruel to Cinderella, she doesn't appear to care that much more for her biological daughters.",
        "trivia": "Lady Tremaine is one of only three main antagonists in a Disney cartoon who is confirmed to be a biological parent."
    },"character15":{
        "name": "Aurora",
        "role": "Protagonist",
        "description": "Also known as Briar Rose. A graceful and sheltered young woman who was raised by fairies. On her 16th birthday, she was put under a spell to remain eternally asleep.",
        "trivia": "Aurora is the only one of the four princesses whose story involved an arranged marriage to actually marry her betrothed."
    },"character16":{
        "name": "Maleficent",
        "role": "Antagonist",
        "description": "A malevolent fairy who represents pure evil. As retribution for not being invited to Aurora's christening, she curses the infant princess to die on her 16th birthday.",
        "trivia": "Maleficent has no speaking lines addressed to Aurora, despite the latter being the movie's protagonist."
    },"character17":{
        "name": "Ariel",
        "role": "A young mermaid princess with a love of the human world. She makes a deal with the evil sea witch, Ursula, in order to change her tail into a pair of legs.",
        "description": "Ariel is the first and only Disney princess to be confirmed to have a child.",
        "trivia": "add"
    },"character18":{
        "name": "Ursula",
        "role": "Antagonist",
        "description": "An octopus-like mermaid and evil sea witch. She grants Ariel human legs in exchange for her voice, which she uses to seduce the prince Ariel was trying to pursue.",
        "trivia": "In later movies, she is shown to have a sister who is equally evilly-inclined."
    },"character19":{
        "name": "Belle",
        "role": "Protagonist",
        "description": "An outspoken and bookish young woman. She lives with her inventor father and exchanged her freedom for his when her father was captured by the Beast.",
        "trivia": "add"
    },"character20":{
        "name": "Beast",
        "role": "Protagonist",
        "description": "Originally called Prince Adam, the Beast is a young prince who was turned into a beast by an enchantress after being rude to her. He seems to be an antagonist at first, but grows to be kinder over the course of the movie.",
        "trivia": "The Beast's design is a mix of several animals, including a buffalo, lion, bear, gorilla, and boar."
    },"character21":{
        "name": "Simba",
        "role": "Protagonist",
        "description": "The young heir of Pride Rock. After his father's death, he runs away to live in the jungle, only to return and take his rightful place.",
        "trivia": "Simba is the first animated Disney character to have a villain as a biological relative."
    },"character22":{
        "name": "Scar",
        "role": "Antagonist",
        "description": "Simba's uncle. He harbors a deep resentment for his nephew and plots to have him exiled from the pride so he can take over as the kind of lions.",
        "trivia": "Scar is a nickname; his true name is Taka, which means trash in Swahili."
    },"character23":{
        "name": "Pocahontas",
        "role": "Protagonist",
        "description": "A spirited young woman from the Powhatan tribe. She is the only Disney princess to be a fictionalized version of a real person.",
        "trivia": "Her real life counterpart was a child at the time her movie takes place."
    },"character24":{
        "name": "Mulan",
        "role": "Protagonist",
        "description": "A determined young woman who takes on the alter-ego of Hua Ping in order to spare her aging father from having to go to war. Over the course of her training, she becomes a formidable warrior.",
        "trivia": "Mulan is the only Disney Princess to not be born royal or marry into royalty in her main movie."
    },"character25":{
        "name": "Tarzan",
        "role": "Protagonist",
        "description": "A curious, but unmannered man who was raised by gorillas in the jungle after his human parents were killed by wild animals.",
        "trivia": "The writers of Frozen have stated that Tarzan is the long-lost sibling of Anna and Elsa. The canonicity of this statement is questionable."
    },"character26":{
        "name": "Jane",
        "role": "A young British woman with a fondness for exploration and academics. Upon meeting Tarzan, she takes it upon herself to teach Tarzan how to be a human instead of a gorilla.",
        "description": "Jane is the only female lead during the Disney Renaissance era who doesn't sing.",
        "trivia": "add"
    },"character27":{
        "name": "Lilo",
        "role": "Protagonist",
        "description": "A five year old girl with a world of her own. She lives in Hawaii with her older sister, who took custody of her after their parents died. She's known for having behavioral issues, likely from the trauma of losing her parents.",
        "trivia": "In further appearances, Lilo seems to be the ambassador of Earth to what is known as the Galactic Federation."
    },"character28":{
        "name": "Stitch",
        "role": "Protagonist",
        "description": "A rogue experimental life form made my an evil scientist. At the beginning of the movie, he is feral and destructive, but becomes tamer and pleasant by the end of the movie.",
        "trivia": "Stitch seems to have a fondness for frogs."
    },"character29":{
        "name": "Tiana",
        "role": "Protagonist",
        "description": "An ambitious young woman living in 1920s Louisiana. She dreams of fulfilling her father's long-time goal of opening a restaurant.",
        "trivia": "Tiana has under 20 minutes of screen time as a human; the rest of her screen time is spent as a frog."
    },"character30":{
        "name": "Naveen",
        "role": "Protagonist",
        "description": "A well-meaning, but naive and somewhat selfish prince. He is turned into a frog by the evil Doctor Facilie. Over the course of the movie, becomes kinder and less self-centered.",
        "trivia": "The country Naveen comes from is named Maldonia, which is a combination of Maldives and Macedonia."
    },"character31":{
        "name": "Rapunzel",
        "role": "Protagonist",
        "description": "An optimistic young woman who spent most of her life in a remote tower. She loves painting and seems to be good with animals, despite presumably not having much experience with animals. She is the kidnapped princess of the kingdom of Corona.",
        "trivia": "Rapunzel is a German name which means lettuce."
    },"character32":{
        "name": "Flynn Rider",
        "role": "Protagonist",
        "description": "A young orphan and a thief who stumbles upon Rapunzel's tower and is persuaded to help her escape. His real name is Eugene Fitzherbert.",
        "trivia": "Flynn is the second Disney prince to not be born royal, instead marrying into royalty."
    },"character33":{
        "name": "Mother Gothel",
        "role": "Antagonist",
        "description": "A presumably ancient woman who has used the power of a magic flower to keep herself youthful. She kidnapped Rapunzel when the latter was an infant. She presents herself as caring and motherly, but is really cunning and ruthless.",
        "trivia": "In a sequel TV show, Mother Gothel is revealed to have a biological daughter."
    },"character34":{
        "name": "Winnie the Pooh",
        "role": "Protagonist",
        "description": "A stuffed yellow bear with a fondness for honey. He is clumsy and bumbling, but does his best to look out for his friends.",
        "trivia": "Winnie the Pooh was named after a real life bear in a zoo."
    },"character35":{
        "name": "Anna",
        "role": "Protagonist",
        "description": "The younger princess of Arendelle. She is optimistic and outgoing, but socially awkward due to a lack of contact with the world outside of her palace. She loves her sister and does her best to remain in touch with her, despite being repeatedly rejected.",
        "trivia": "Her favorite game is chess."
    },"character36":{
        "name": "Elsa",
        "role": "Protagonist",
        "description": "The older princess of Arendelle. As a child, she seems to have been playful and upbeat, but after accidentally hurting her sister with her magic, became very reserved.",
        "trivia": "Her birthday is December 21."
    },"character37":{
        "name": "Judy Hopps",
        "role": "Protagonist",
        "description": "An optimistic bunny who has dreamed of being a police officer for her entire life, despite her parents' reservations. Over the course of the movie, she learns to be less naive, but remains cheerful.",
        "trivia": "Judy's eyes are purple in order to add color to her character design, as the rest of her is mostly gray."
    },"character38":{
        "name": "Nick Wilde",
        "role": "Protagonist",
        "description": "A sly and crafty fox who has made a living as a con artist. He agrees to assist Judy Hopps in an investigation to get out of being convicted for tax fraud. By the time the movie ends, he has learned to be more honest and to not let stereotypes define him.",
        "trivia": "Nick only refers to Judy by her given name once in the movie. He usually calls her Carrots instead."
    },"character39":{
        "name": "Moana",
        "role": "Protagonist",
        "description": "The daughter of her tribe's chief. She is strong-willed and driven, with a love of adventure and exploration. When the resources her people rely on begin to run out, she takes it upon herself to seek out Maui the demigod to restore vitality to the island.",
        "trivia": "Moana's name means ocean, which is ironic, given that she was strictly forbidden from sailing."
    },"character40":{
        "name": "Maui",
        "role": "Protagonist",
        "description": "The demigod of the wind and sea. He is pompous and overconfident to make up for his insecurities and desire to be wanted. After spending a lot of time with Moana, he becomes more humble and gains a great respect for Moana.",
        "trivia": "Maui is based on real-life legends in the Pacific Islands."
    },"character41":{
        "name": "Ralph",
        "role": "Protagonist",
        "description": "A retro video game antagonist who has grown fed up with being a bad guy. He leaves his game in order to find a way to become a 'good guy'. By the end of the movie, he comes to terms with his role in his game and realizes he can be the 'bad guy' of a game without being a bad person.",
        "trivia": "His role in his video game seems to be similar to that of Donkey Kong in the retro arcade game of the same name."
    },"character42":{
        "name": "Vanellope",
        "role": "Protagonist",
        "description": "A fun loving and somewhat awkward girl who is part of the racing game Sugar Rush. At first, she appears to be a a glitch in the game, but it turns out that her files were corrupted and removed from the game by a rogue character from an old game. She is childish, but becomes more mature during the movie.",
        "trivia": "At the end of the first movie, she declares herself President Vanellope. This title is never referenced in the sequel."
    },"character43":{
        "name": "Mirabel",
        "role": "Protagonist",
        "description": "An upbeat 15 year old who marches to her own beat. She is the only member of her family besides her grandmother who does not have any magical abilities. When her family doesn't take her seriously when she warns them of approaching danger, she takes it upon herself to attempt to save her family.",
        "trivia": "Mirabel is the only female protagonist in a Disney cartoon to wear glasses."
    }

}